artillery/gettest.yaml
config:
  target: 'http://127.0.0.1:3003'
  http:
    pool: 100
  processor: './test-functions.js'
  phases:
    - duration: 120
      arrivalRate: 10
      rampTo: 30
      name: 'warmup'
    - duration: 300
      arrivalRate: 30
      name: 'looping 20 requests at 30 arrivals per second'
  defaults:
    headers:
scenarios:
  - name: 'Bottom 9000000'
    weight: 1
    flow:
      -  count: 25
         loop:
          - function: 'generateLowId'
          - think: 3
          - get:
              url: '/api/related_products/{{ id }}'
  - name: 'Top 1000000'
    weight: 9
    flow:
      -  count: 25
         loop:
          - function: 'generateHighId'
          - think: 3
          - get:
              url: '/api/related_products/{{ id }}'